MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_xmit.c
		case IEEE80211_RADIOTAP_MCS: {
			u8 mcs_known = iterator.this_arg[0];
			u8 mcs_flags = iterator.this_arg[1];
			if (!(mcs_known & IEEE80211_RADIOTAP_MCS_HAVE_MCS))
				break;

			fixed_rate = iterator.this_arg[2] & 0x7f;

			if (mcs_known & IEEE80211_RADIOTAP_MCS_HAVE_MCS) {
				fixed_rate = iterator.this_arg[2] & 0x7f;
				if (fixed_rate > 31)
					fixed_rate = 0;
				fixed_rate += MGN_MCS0;
			}
			if ((mcs_known & IEEE80211_RADIOTAP_MCS_HAVE_GI) &&
			    (mcs_flags & IEEE80211_RADIOTAP_MCS_SGI))
				sgi = 1;
			if ((mcs_known & IEEE80211_RADIOTAP_MCS_HAVE_BW) &&
			    (mcs_flags & IEEE80211_RADIOTAP_MCS_BW_40))
				bwidth = CHANNEL_WIDTH_40;
			if ((mcs_known & IEEE80211_RADIOTAP_MCS_HAVE_FEC) &&
			    (mcs_flags & IEEE80211_RADIOTAP_MCS_FEC_LDPC))
				ldpc = 1;
			if ((mcs_known & IEEE80211_RADIOTAP_MCS_HAVE_STBC)) {
				stbc = (mcs_flags &
					IEEE80211_RADIOTAP_MCS_STBC_MASK) >>
				       IEEE80211_RADIOTAP_MCS_STBC_SHIFT;
			}
			break;
		}

		case IEEE80211_RADIOTAP_VHT: {
			u16 vht_known = get_unaligned_le16(iterator.this_arg);
			u8 vht_flags = iterator.this_arg[2];
			unsigned int mcs, nss;

			if ((vht_known & IEEE80211_RADIOTAP_VHT_KNOWN_GI) &&
			    (vht_flags & IEEE80211_RADIOTAP_VHT_FLAG_SGI))
				sgi = 1;
			if (vht_known &
			    IEEE80211_RADIOTAP_VHT_KNOWN_BANDWIDTH) {
				bwidth = iterator.this_arg[3] & 0x1f;
				if(bwidth >= 1 && bwidth <= 3)
					bwidth = CHANNEL_WIDTH_40;
				else if(bwidth >= 4 && bwidth <= 10)
					bwidth = CHANNEL_WIDTH_80;
				else
					bwidth = CHANNEL_WIDTH_20;
			}
			if((vht_known & IEEE80211_RADIOTAP_VHT_KNOWN_STBC) &&
			   (vht_flags & IEEE80211_RADIOTAP_VHT_FLAG_STBC))
				stbc = 1;
			if (vht_known & IEEE80211_RADIOTAP_VHT_KNOWN_LDPC_EXTRA_OFDM_SYM &&
			    vht_flags & IEEE80211_RADIOTAP_VHT_FLAG_LDPC_EXTRA_OFDM_SYM &&
			    iterator.this_arg[8] & 0x0f)
				ldpc = 1;
			mcs = (iterator.this_arg[4] >> 4) & 0x0f;
			nss = iterator.this_arg[4] & 0x0f;
			if(nss > 0) {
				if(nss > 4) nss = 4;
				if(mcs > 9) mcs = 9;
				fixed_rate = MGN_VHT1SS_MCS0 + ((nss - 1) * 10 + mcs);
			}
			break;
		}

		default:
			break;
		}
	}

	/* Skip the ratio tap header */
	skb_pull(skb, rtap_len);

no_rtap_tx:
#endif
	pmgntframe = alloc_mgtxmitframe(pxmitpriv);
	if (pmgntframe == NULL) {
		rtw_udelay_os(500);
		goto fail;
	}

	_rtw_memset(pmgntframe->buf_addr, 0, WLANHDR_OFFSET + TXDESC_OFFSET);
	pframe = (u8 *)(pmgntframe->buf_addr) + TXDESC_OFFSET;

	skb_copy_bits(skb, 0, (void*)pframe, skb->len);

	pattrib = &pmgntframe->attrib;

	/* Check DATA/MGNT frames */
	pwlanhdr = (struct rtw_ieee80211_hdr *)pframe;
	frame_ctl = le16_to_cpu(pwlanhdr->frame_ctl);
	if ((frame_ctl & RTW_IEEE80211_FCTL_FTYPE) == RTW_IEEE80211_FTYPE_DATA)
		update_monitor_frame_attrib(padapter, &pmgntframe->attrib);
	else
		update_mgntframe_attrib(padapter, &pmgntframe->attrib);
	pattrib->pktlen = skb->len;
	pattrib->rate = fixed_rate;
	pattrib->retry_ctrl = retry_ctrl;
	pmlmeext->mgnt_seq = GetSequence(pwlanhdr);
	pattrib->seqnum = pmlmeext->mgnt_seq;
	pmlmeext->mgnt_seq++;
	pattrib->last_txcmdsz = pattrib->pktlen;
	pattrib->sgi = sgi;
	pattrib->bwmode = bwidth;
	pattrib->ldpc = ldpc;
	pattrib->stbc = stbc;

	dump_mgntframe(padapter, pmgntframe);

	DBG_COUNTER(padapter->tx_logs.core_tx);
	pxmitpriv->tx_pkts++;
	pxmitpriv->tx_bytes += skb->len;

fail:
	rtw_skb_free(skb);
	return 0;
}
#endif

/*
 *
 * Return _TRUE when frame has been put to queue, otherwise return _FALSE.
 */
static u8 xmit_enqueue(struct _ADAPTER *a, struct xmit_frame *frame)
{
	struct sta_info *sta = NULL;
	struct pkt_attrib *attrib = NULL;
	_irqL irqL;
	_list *head;
	u8 ret = _TRUE;


	attrib = &frame->attrib;
	sta = attrib->psta;
	if (!sta)
		return _FALSE;

	_enter_critical_bh(&sta->tx_queue.lock, &irqL);

	head = get_list_head(&sta->tx_queue);

	if ((rtw_is_list_empty(head) == _TRUE) && (!sta->tx_q_enable)) {
		ret = _FALSE;
		goto exit;
	}

	rtw_list_insert_tail(&frame->list, head);
	RTW_INFO(FUNC_ADPT_FMT ": en-queue tx pkt for macid=%d\n",
		 FUNC_ADPT_ARG(a), sta->cmn.mac_id);

exit:
	_exit_critical_bh(&sta->tx_queue.lock, &irqL);

	return ret;
}

static void xmit_dequeue(struct sta_info *sta)
{
	struct _ADAPTER *a;
	_irqL irqL;
	_list *head, *list;
	struct xmit_frame *frame;


	a = sta->padapter;

	_enter_critical_bh(&sta->tx_queue.lock, &irqL);

	head = get_list_head(&sta->tx_queue);

	do {
		if (rtw_is_list_empty(head) == _TRUE)
			break;

		list = get_next(head);
		rtw_list_delete(list);
		frame = LIST_CONTAINOR(list, struct xmit_frame, list);
		RTW_INFO(FUNC_ADPT_FMT ": de-queue tx frame of macid=%d\n",
			 FUNC_ADPT_ARG(a), sta->cmn.mac_id);

		rtw_hal_xmit(a, frame);
	} while (1);

	_exit_critical_bh(&sta->tx_queue.lock, &irqL);
}

void rtw_xmit_dequeue_callback(_workitem *work)
{
	struct sta_info *sta;


	sta = container_of(work, struct sta_info, tx_q_work);
	xmit_dequeue(sta);
}

void rtw_xmit_queue_set(struct sta_info *sta)
{
	_irqL irqL;

	_enter_critical_bh(&sta->tx_queue.lock, &irqL);

	if (sta->tx_q_enable) {
		RTW_WARN(FUNC_ADPT_FMT ": duplicated set!\n",
			 FUNC_ADPT_ARG(sta->padapter));
		goto exit;
	}
	sta->tx_q_enable = 1;
	RTW_INFO(FUNC_ADPT_FMT ": enable queue TX for macid=%d\n",
		 FUNC_ADPT_ARG(sta->padapter), sta->cmn.mac_id);

exit:
	_exit_critical_bh(&sta->tx_queue.lock, &irqL);
}

void rtw_xmit_queue_clear(struct sta_info *sta)
{
	_irqL irqL;

	_enter_critical_bh(&sta->tx_queue.lock, &irqL);

	if (!sta->tx_q_enable) {
		RTW_WARN(FUNC_ADPT_FMT ": tx queue for macid=%d "
			 "not be enabled!\n",
			 FUNC_ADPT_ARG(sta->padapter), sta->cmn.mac_id);
		goto exit;
	}

	sta->tx_q_enable = 0;
	RTW_INFO(FUNC_ADPT_FMT ": disable queue TX for macid=%d\n",
		 FUNC_ADPT_ARG(sta->padapter), sta->cmn.mac_id);

	_set_workitem(&sta->tx_q_work);

exit:
	_exit_critical_bh(&sta->tx_queue.lock, &irqL);
}

/*
 * The main transmit(tx) entry post handle
 *
 * Return
 *	1	enqueue
 *	0	success, hardware will handle this xmit frame(packet)
 *	<0	fail
 */
s32 rtw_xmit_posthandle(_adapter *padapter, struct xmit_frame *pxmitframe, _pkt *pkt)
{
#ifdef CONFIG_AP_MODE
	_irqL irqL0;
#endif
	struct xmit_priv *pxmitpriv = &padapter->xmitpriv;
	s32 res;

	res = update_attrib(padapter, pkt, &pxmitframe->attrib);

#ifdef CONFIG_MCC_MODE
	/* record data kernel TX to driver to check MCC concurrent TX */
	rtw_hal_mcc_calc_tx_bytes_from_kernel(padapter, pxmitframe->attrib.pktlen);
#endif /* CONFIG_MCC_MODE */

#ifdef CONFIG_WAPI_SUPPORT
	if (pxmitframe->attrib.ether_type != 0x88B4) {
		if (rtw_wapi_drop_for_key_absent(padapter, pxmitframe->attrib.ra)) {
			WAPI_TRACE(WAPI_RX, "drop for key absend when tx\n");
			res = _FAIL;
		}
	}
#endif
	if (res == _FAIL) {
		/*RTW_INFO("%s-"ADPT_FMT" update attrib fail\n", __func__, ADPT_ARG(padapter));*/
#ifdef DBG_TX_DROP_FRAME
		RTW_INFO("DBG_TX_DROP_FRAME %s update attrib fail\n", __FUNCTION__);
#endif
		rtw_free_xmitframe(pxmitpriv, pxmitframe);
		return -1;
	}
	pxmitframe->pkt = pkt;

	rtw_led_tx_control(padapter, pxmitframe->attrib.dst);

	do_queue_select(padapter, &pxmitframe->attrib);

