MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_xmit.c
			pxmitframe->attrib.triggered = 1;

			rtw_hal_mgmt_xmitframe_enqueue(padapter, pxmitframe);
		}
	}
#endif /* CONFIG_RTW_MGMT_QUEUE */

	if (dequeue_type == UNI_BMC_DATA || dequeue_type == ALL_FRAME) {
		/* AC queue */
		xmitframe_phead = get_list_head(&psta->sleep_q);
		xmitframe_plist = get_next(xmitframe_phead);

		while ((rtw_end_of_queue_search(xmitframe_phead, xmitframe_plist)) == _FALSE) {
			pxmitframe = LIST_CONTAINOR(xmitframe_plist, struct xmit_frame, list);

			xmitframe_plist = get_next(xmitframe_plist);

			rtw_list_delete(&pxmitframe->list);

			switch (pxmitframe->attrib.priority) {
			case 1:
			case 2:
				wmmps_ac = psta->uapsd_bk & BIT(1);
				break;
			case 4:
			case 5:
				wmmps_ac = psta->uapsd_vi & BIT(1);
				break;
			case 6:
			case 7:
				wmmps_ac = psta->uapsd_vo & BIT(1);
				break;
			case 0:
			case 3:
			default:
				wmmps_ac = psta->uapsd_be & BIT(1);
				break;
			}

			psta->sleepq_len--;
			if (psta->sleepq_len > 0)
				pxmitframe->attrib.mdata = 1;
			else
				pxmitframe->attrib.mdata = 0;

			if (wmmps_ac) {
				psta->sleepq_ac_len--;
				if (psta->sleepq_ac_len > 0) {
					pxmitframe->attrib.mdata = 1;
					pxmitframe->attrib.eosp = 0;
				} else {
					pxmitframe->attrib.mdata = 0;
					pxmitframe->attrib.eosp = 1;
				}
			}

			pxmitframe->attrib.triggered = 1;

			/*
					_exit_critical_bh(&psta->sleep_q.lock, &irqL);
					if(rtw_hal_xmit(padapter, pxmitframe) == _TRUE)
					{
						rtw_os_xmit_complete(padapter, pxmitframe);
					}
					_enter_critical_bh(&psta->sleep_q.lock, &irqL);
			*/
			rtw_hal_xmitframe_enqueue(padapter, pxmitframe);
		}
	}

	if (psta->sleepq_len == 0
#ifdef CONFIG_RTW_MGMT_QUEUE
		&& psta->mgmt_sleepq_len == 0
#endif
	) {
#ifdef CONFIG_TDLS
		if (psta->tdls_sta_state & TDLS_LINKED_STATE) {
			if (psta->state & WIFI_SLEEP_STATE)
				psta->state ^= WIFI_SLEEP_STATE;

			_exit_critical_bh(&pxmitpriv->lock, &irqL);
			return;
		}
#endif /* CONFIG_TDLS */

		if (rtw_tim_map_is_set(padapter, pstapriv->tim_bitmap, psta->cmn.aid)) {
			/* RTW_INFO("wakeup to xmit, qlen==0\n"); */
			/* RTW_INFO_DUMP("update_BCNTIM, tim=", pstapriv->tim_bitmap, pstapriv->aid_bmp_len); */
			/* upate BCN for TIM IE */
			/* update_BCNTIM(padapter); */
			update_mask = BIT(0);
		}

		rtw_tim_map_clear(padapter, pstapriv->tim_bitmap, psta->cmn.aid);

		if (psta->state & WIFI_SLEEP_STATE)
			psta->state ^= WIFI_SLEEP_STATE;

		if (psta->state & WIFI_STA_ALIVE_CHK_STATE) {
			RTW_INFO("%s alive check\n", __func__);
			psta->expire_to = pstapriv->expire_to;
			psta->state ^= WIFI_STA_ALIVE_CHK_STATE;
		}

		rtw_tim_map_clear(padapter, pstapriv->sta_dz_bitmap, psta->cmn.aid);
	}

	if (dequeue_type == UNI_BMC_DATA || dequeue_type == ALL_FRAME) {
		psta_bmc = rtw_get_bcmc_stainfo(padapter);

		/* for BC/MC Frames */
		if (!psta_bmc)
			goto _exit;

		if (!(rtw_tim_map_anyone_be_set_exclude_aid0(padapter, pstapriv->sta_dz_bitmap))) { /* no any sta in ps mode */
			xmitframe_phead = get_list_head(&psta_bmc->sleep_q);
			xmitframe_plist = get_next(xmitframe_phead);

			while ((rtw_end_of_queue_search(xmitframe_phead, xmitframe_plist)) == _FALSE) {
				pxmitframe = LIST_CONTAINOR(xmitframe_plist, struct xmit_frame, list);

				xmitframe_plist = get_next(xmitframe_plist);

				rtw_list_delete(&pxmitframe->list);

				psta_bmc->sleepq_len--;
				if (psta_bmc->sleepq_len > 0)
					pxmitframe->attrib.mdata = 1;
				else
					pxmitframe->attrib.mdata = 0;

				pxmitframe->attrib.triggered = 1;
				/*
							_exit_critical_bh(&psta_bmc->sleep_q.lock, &irqL);
							if(rtw_hal_xmit(padapter, pxmitframe) == _TRUE)
							{
								rtw_os_xmit_complete(padapter, pxmitframe);
							}
							_enter_critical_bh(&psta_bmc->sleep_q.lock, &irqL);

				*/
				rtw_hal_xmitframe_enqueue(padapter, pxmitframe);

			}

			if (psta_bmc->sleepq_len == 0) {
				if (rtw_tim_map_is_set(padapter, pstapriv->tim_bitmap, 0)) {
					/* RTW_INFO("wakeup to xmit, qlen==0\n"); */
					/* RTW_INFO_DUMP("update_BCNTIM, tim=", pstapriv->tim_bitmap, pstapriv->aid_bmp_len); */
					/* upate BCN for TIM IE */
					/* update_BCNTIM(padapter); */
					update_mask |= BIT(1);
				}
				rtw_tim_map_clear(padapter, pstapriv->tim_bitmap, 0);
				rtw_tim_map_clear(padapter, pstapriv->sta_dz_bitmap, 0);
			}
		}
	}
_exit:

	/* _exit_critical_bh(&psta_bmc->sleep_q.lock, &irqL);	 */
	_exit_critical_bh(&pxmitpriv->lock, &irqL);

	if (update_mask) {
		/* update_BCNTIM(padapter); */
		if ((update_mask & (BIT(0) | BIT(1))) == (BIT(0) | BIT(1)))
			_update_beacon(padapter, _TIM_IE_, NULL, _TRUE, 0, "clear UC&BMC");
		else if ((update_mask & BIT(1)) == BIT(1))
			_update_beacon(padapter, _TIM_IE_, NULL, _TRUE, 0, "clear BMC");
		else
			_update_beacon(padapter, _TIM_IE_, NULL, _TRUE, 0, "clear UC");
	}
}

void xmit_delivery_enabled_frames(_adapter *padapter, struct sta_info *psta)
{
	_irqL irqL;
	u8 wmmps_ac = 0;
	_list	*xmitframe_plist, *xmitframe_phead;
	struct xmit_frame *pxmitframe = NULL;
	struct sta_priv *pstapriv = &padapter->stapriv;
	struct xmit_priv *pxmitpriv = &padapter->xmitpriv;


	/* _enter_critical_bh(&psta->sleep_q.lock, &irqL); */
	_enter_critical_bh(&pxmitpriv->lock, &irqL);

	xmitframe_phead = get_list_head(&psta->sleep_q);
	xmitframe_plist = get_next(xmitframe_phead);

	while ((rtw_end_of_queue_search(xmitframe_phead, xmitframe_plist)) == _FALSE) {
		pxmitframe = LIST_CONTAINOR(xmitframe_plist, struct xmit_frame, list);

		xmitframe_plist = get_next(xmitframe_plist);

		switch (pxmitframe->attrib.priority) {
		case 1:
		case 2:
			wmmps_ac = psta->uapsd_bk & BIT(1);
			break;
		case 4:
		case 5:
			wmmps_ac = psta->uapsd_vi & BIT(1);
			break;
		case 6:
		case 7:
			wmmps_ac = psta->uapsd_vo & BIT(1);
			break;
		case 0:
		case 3:
		default:
			wmmps_ac = psta->uapsd_be & BIT(1);
			break;
		}

		if (!wmmps_ac)
			continue;

		rtw_list_delete(&pxmitframe->list);

		psta->sleepq_len--;
		psta->sleepq_ac_len--;

		if (psta->sleepq_ac_len > 0) {
			pxmitframe->attrib.mdata = 1;
			pxmitframe->attrib.eosp = 0;
		} else {
			pxmitframe->attrib.mdata = 0;
			pxmitframe->attrib.eosp = 1;
		}

